<script type="text/javascript">
$(function(){
	function displayResultBus(item){
		if(item.text!=='Result not Found'){
			var prefix='http://mybuses.ru/';
			var postfix='/bus/';
			var postfixxx='/';
			var town='chehov';
			var src=prefix+town+postfix+item.value+postfixxx;window.open(src, "_self");
		}else{
			$('.alert-bus').show().html('Увы ничего не найдено, попытайтесь снова');
		}
	}
	$('#bus_typeahead').typeahead({
		source:[{"id":"3","name":"3 - ст. Чехов – Ровки"},{"id":"4","name":"4 - з-д Энергомаш – мкр. Губернский"},{"id":"8","name":"8 - ст. Чехов – з-д Энергомаш – ДС \"Олимпийский\" – ст. Чехов"},{"id":"9","name":"9 - ст. Чехов – ДС \"Олимпийский\" – з-д Энергомаш – ст. Чехов"},{"id":"21","name":"21 - Чехов – ф-ка Пролетарий"},{"id":"22","name":"22 - Чехов – Алачково"},{"id":"23","name":"23 - Чехов – Репниково – Ходаево"},{"id":"24","name":"24 - Чехов – Ходаево"},{"id":"25","name":"25 - Чехов – Нерастанное"},{"id":"26","name":"26 - Чехов – Ваулово"},{"id":"27","name":"27 - Чехов – Стремилово – Леоново"},{"id":"28","name":"28 - Чехов – Спас-Темня"},{"id":"29","name":"29 - Чехов – Русское поле – Сенино"},{"id":"30","name":"30 - Чехов – Булгаково"},{"id":"31","name":"31 - ст. Столбовая – б-ца №5 – Сидориха"},{"id":"32","name":"32 - ст. Столбовая – Больница Яковенко – Столбищево"},{"id":"34","name":"34 - Чехов – Чернецкое"},{"id":"35","name":"35 - Чехов – Гришино"},{"id":"36","name":"36 - Чехов - Новый Быт - Красные Орлы"},{"id":"37","name":"37 - ст. Столбовая – Добрыниха"},{"id":"38","name":"38 - Чехов – Санаторий Солнышко"},{"id":"39","name":"39 - Чехов – Беляево – Вауловская церковь"},{"id":"40","name":"40 - Чехов – Солодовка"},{"id":"60","name":"60 - ст. Чехов – Троицкое – Яковенко"},{"id":"61","name":"61 - ст. Подольск – ст. Чехов"},{"id":"365","name":"365 - Чехов – Чепелево – Москва (м. Южная)"},{"id":"423","name":"423 - Столбищево – Добрыниха – Москва (м. Южная)"},{"id":"427","name":"427 - Ваулово – Москва (м. Теплый Стан)"},{"id":"428","name":"428 - Чехов – Нерастанное – Москва (м. Южная)"}],
		onSelect: displayResultBus
	});
});
</script>