<script type="text/javascript">
$(function(){
	function displayResultBus(item){
		if(item.text!=='Result not Found'){
			var prefix='http://mybuses.ru/';
			var postfix='/bus/';
			var postfixxx='/';
			var town='dolgoprudnij';
			var src=prefix+town+postfix+item.value+postfixxx;window.open(src, "_self");
		}else{
			$('.alert-bus').show().html('Увы ничего не найдено, попытайтесь снова');
		}
	}
	$('#bus_typeahead').typeahead({
		source:[{"id":"1","name":"1 - ст. Долгопрудная – ул. Спортивная  – ст. Долгопрудная"},{"id":"2","name":"2 - Автопарк – военкомат – Автопарк"},{"id":"3","name":"3 - ст. Долгопрудная – м\/р Павельцево"},{"id":"4","name":"4 - ст. Долгопрудная – м\/р Водники"},{"id":"5","name":"5 - ст. Химки – Химки (платф. Левобережная)"},{"id":"21","name":"21 - Лобня (м\/р Южный) – Шереметьево 1"},{"id":"32","name":"32 - ст. Долгопрудная – Химки (ул. Дружбы)"},{"id":"33","name":"33 - ст. Долгопрудная – Ново-Александрово"},{"id":"36","name":"36 - ст. Лобня – Новосельцево"},{"id":"37","name":"37 - д\/о Марфино – ст. Катуар"},{"id":"38","name":"38 - ст. Долгопрудная – Шереметьево-1 – ст. Лобня"},{"id":"42","name":"42 - Федоскино – ст. Лобня"},{"id":"70","name":"70 - Д\/о Аксаково – ст. Катуар"},{"id":"73","name":"73 - ст. Катуар – 12-я Паромная переправа"},{"id":"302","name":"302 - Троицкое – Москва (м. Алтуфьево)"},{"id":"344","name":"344 - Химки (платф. Левобережная) – Москва (м. Речной вокзал)"},{"id":"368","name":"368 - ст. Долгопрудная – Москва (м. Речной вокзал)"},{"id":"456","name":"456 - Долгопрудный (ДК \"Вперед\") – Москва (м. Алтуфьево)"},{"id":"472","name":"472 - ст. Долгопрудная – Москва (м. Сходненская)"},{"id":"1062","name":"1062 - Химки (ул. Совхозная) - Москва (м. Алтуфьево)"},{"id":"1078","name":"1078 - ст. Долгопрудная – Химки (платф. Левобережная)"}],
		onSelect: displayResultBus
	});
});
</script>