<script type="text/javascript">
$(function(){
	function displayResultBus(item){
		if(item.text!=='Result not Found'){
			var prefix='http://mybuses.ru/';
			var postfix='/bus/';
			var postfixxx='/';
			var town='dmitrov';
			var src=prefix+town+postfix+item.value+postfixxx;window.open(src, "_self");
		}else{
			$('.alert-bus').show().html('Увы ничего не найдено, попытайтесь снова');
		}
	}
	$('#bus_typeahead').typeahead({
		source:[{"id":"1","name":"1 - Завод ТПИ – ул. Космонавтов"},{"id":"2","name":"2 - Вокзал – завод МЖБК – Сады"},{"id":"5","name":"5 - Вокзал – ул. Подъячева – м\/р Космонавтов"},{"id":"7","name":"7 - Вокзал – ул. Космонавтов – м\/р Махалина – Вокзал"},{"id":"9","name":"9 - ул. Большевистская – ст. Яхрома"},{"id":"10","name":"10 - Вокзал – ул. Космонавтов"},{"id":"20","name":"20 - Дмитров – Мельчевка"},{"id":"22","name":"22 - Дмитров – ст. Турист – Дьяково"},{"id":"24","name":"24 - Дмитров – ст. Костино"},{"id":"25","name":"25 - Дмитров – Княжево"},{"id":"26","name":"26 - Дмитров – Саввино – Никитино – Старово"},{"id":"28","name":"28 - Дмитров – ф-ка 1-е Мая"},{"id":"29","name":"29 - Дмитров – РТС – Б. Кузнецово"},{"id":"31","name":"31 - Дмитров – Подъячево – Федоровка"},{"id":"32","name":"32 - Дмитров – ст. Икша – сан. Горки"},{"id":"34","name":"34 - Дмитров – Липино – Канал им. Москвы"},{"id":"36","name":"36 - Дмитров – Рогачево – Нижнево"},{"id":"38","name":"38 - Дмитров (завод ТПИ) – Яхрома (ул. Ленина)"},{"id":"40","name":"40 - Дмитров – Рыбное"},{"id":"41","name":"41 - Дмитров – Автополигон"},{"id":"42","name":"42 - Дмитров – Ильинское"},{"id":"43","name":"43 - ст. Икша – Ассаурово – Дмитров"},{"id":"45","name":"45 - Шпилево – Прудцы"},{"id":"47","name":"47 - ст. Икша – Долгиниха"},{"id":"49","name":"49 - Дмитров – Высоково"},{"id":"50","name":"50 - Рогачево – ст. Лобня"},{"id":"51","name":"51 - Дмитров – Думино"},{"id":"53","name":"53 - Дмитров – Вороново"},{"id":"54","name":"54 - Дмитров – Яхрома – Шустино"},{"id":"60","name":"60 - ст. Лобня - Марфино"},{"id":"63","name":"63 - Дмитров – Сергиев Посад"},{"id":"401","name":"401 - Дмитров – Москва (м. Алтуфьево)"},{"id":"459","name":"459 - ст. Лобня - Москва (м. Алтуфьево)"},{"id":"519","name":"519 - Марфино - Москва (м. Алтуфьево)"}],
		onSelect: displayResultBus
	});
});
</script>