<script type="text/javascript">
$(function(){
	function displayResultBus(item){
		if(item.text!=='Result not Found'){
			var prefix='http://mybuses.ru/';
			var postfix='/bus/';
			var postfixxx='/';
			var town='balashiha';
			var src=prefix+town+postfix+item.value+postfixxx;window.open(src, "_self");
		}else{
			$('.alert-bus').show().html('Увы ничего не найдено, попытайтесь снова');
		}
	}
	$('#bus_typeahead').typeahead({
		source:[{"id":"2","name":"2 - ст. Железнодорожная – Жилгородок – ЦГБ – м\/р Павлино, д.21"},{"id":"4","name":"4 - ст. Железнодорожная – Темниково"},{"id":"5","name":"5 - Балашиха 3 – ст. Салтыковская"},{"id":"7","name":"7 - ст. Железнодорожная – Агрогородок"},{"id":"8","name":"8 - а\/с Южная – Балашиха-2 – Химзавод – а\/с Южная"},{"id":"9","name":"9 - ст. Железнодорожная – м\/р Павлино"},{"id":"10","name":"10 - ст. Железнодорожная – Агрогородок"},{"id":"11","name":"11 - ст. Кучино – м\/р Павлино"},{"id":"12","name":"12 - ст. Железнодорожная – м\/р Ольгино"},{"id":"14","name":"14 - а\/с Южная – Балашиха-2"},{"id":"15","name":"15 - а\/с Южная – Химзавод – Балашиха-2 – а\/с Южная"},{"id":"15_","name":"15 - ст. Реутово - Москва (м. Первомайская)"},{"id":"16","name":"16 - ул. Твардовского – Балашиха-2"},{"id":"17","name":"17 - а\/с Южная – Балашихинское шоссе – а\/с Звездная"},{"id":"17_","name":"17 - ст. Реутово - Москва (м. Новогиреево)"},{"id":"18","name":"18 - ст. Железнодорожная – Жилгородок"},{"id":"19","name":"19 - а\/с Южная – Балашихинское шоссе"},{"id":"20","name":"20 - Балашиха-2 – Агрогородок"},{"id":"22","name":"22 - Балашиха-3 - ст. Никольское"},{"id":"23","name":"23 - ст. Железнодорожная – Полтево"},{"id":"28","name":"28 - Балашиха-2 – ст. Реутово"},{"id":"33","name":"33 - ст. Железнодорожная – Пуршево"},{"id":"65","name":"65 - ст. Железнодорожная – Торбеево"},{"id":"110","name":"110 - Балашиха-2 (СНТ \"Поляна\") – Москва (м. Новогиреево)"},{"id":"142","name":"142 - Агрогородок – Москва (м. Новокосино) – ст. Реутово"},{"id":"193","name":"193 - Балашиха (м\/р Новый свет) – Москва (м. Новогиреево)"},{"id":"300","name":"300 - Балашиха-3 – Москва (м. Щёлковская)"},{"id":"336","name":"336 - Балашиха (а\/с Южная) – Москва (м. Партизанская)"},{"id":"337","name":"337 - Балашиха-3 – Москва (м. Партизанская)"},{"id":"338","name":"338 - ст. Железнодорожная – Москва (м. Щёлковская)"},{"id":"384","name":"384 - Балашиха (а\/с Звездная) – Москва (м. Щелковская)"},{"id":"385","name":"385 - Балашиха-2 – Москва (м. Партизанская)"},{"id":"395","name":"395 - Балашиха-2 – Москва (м. Щёлковская)"},{"id":"396","name":"396 - Балашиха (а\/с Южная) – Москва (м. Щёлковская)"},{"id":"447","name":"447 - Балашиха-2 – Москва (м. Щёлковская)"},{"id":"889","name":"889 - Балашиха (ул. Зелёная) – Москва (м. Щёлковская)"}],
		onSelect: displayResultBus
	});
});
</script>