<script type="text/javascript">
$(function(){
	function displayResultBus(item){
		if(item.text!=='Result not Found'){
			var prefix='http://mybuses.ru/';
			var postfix='/bus/';
			var postfixxx='/';
			var town='domodedovo';
			var src=prefix+town+postfix+item.value+postfixxx;window.open(src, "_self");
		}else{
			$('.alert-bus').show().html('Увы ничего не найдено, попытайтесь снова');
		}
	}
	$('#bus_typeahead').typeahead({
		source:[{"id":"1","name":"1 - ст. Домодедово – ул. Набережная – ст. Домодедово"},{"id":"2","name":"2 - ул. Комсомольская – Поликлиника"},{"id":"6","name":"6 - ст. Домодедово – м\/р Ёлочки – ст. Домодедово"},{"id":"8","name":"8 - ст. Домодедово – Поликлиника – м\/р Елочки"},{"id":"11","name":"11 - м\/р Новое Домодедово (ул. Курыжова) - ст. Взлетная"},{"id":"12","name":"12 - ст. Домодедово - м\/р Новое Домодедово (ул. Курыжова)"},{"id":"18","name":"18 - ст. Домодедово – м\/р Белые столбы"},{"id":"21","name":"21 - ст. Домодедово – Юсупово"},{"id":"22","name":"22 - ст. Домодедово – ст. Ленинская"},{"id":"23","name":"23 - ст. Домодедово – Мещерино – Семивраги – ст. Домодедово"},{"id":"26","name":"26 - Красный путь – аэропорт Домодедово"},{"id":"30","name":"30 - ст. Домодедово – аэропорт Домодедово"},{"id":"31","name":"31 - ст. Домодедово – д\/о \"Бор\""},{"id":"32","name":"32 - ст. Домодедово – сан. Подмосковье – Долматово"},{"id":"33","name":"33 - ст. Домодедово – ГПЗ \"Константиново\""},{"id":"40","name":"40 - Домодедово (ст.Барыбино) – Добрыниха"},{"id":"41","name":"41 - Домодедово (ст.Барыбино) – Введенское"},{"id":"42","name":"42 - Домодедово (ст.Белые Столбы) – Красный путь – городок Шахово"},{"id":"43","name":"43 - Домодедово (ст.Барыбино) – Кишкино"},{"id":"46","name":"46 - Домодедово (ст. Барыбино) – Михайловское"},{"id":"51","name":"51 - Домодедово (ст.Барыбино) – Шишкино"},{"id":"53","name":"53 - ст. Барыбино – ул. Южная"},{"id":"55","name":"55 - ст. Домодедово – Красный Путь – городок Шахово"},{"id":"56","name":"56 - Домодедово (ст.Барыбино) – Б. Алексеевское"},{"id":"57","name":"57 - ст. Домодедово – ст. Подольск"},{"id":"58","name":"58 - ст. Домодедово – Домодедово (ст. Барыбино)"},{"id":"60","name":"60 - Домодедово (ст.Барыбино) – Тишково"},{"id":"62","name":"62 - Домодедово (ст.Барыбино) – платф. Вельяминово"},{"id":"308","name":"308 - Москва (м. Домодедовская) – Аэропорт Домодедово"},{"id":"404","name":"404 - ст. Барыбино – Москва (м. Домодедовская)"},{"id":"420","name":"420 - Константиново – Москва (м. Домодедовская)"},{"id":"433","name":"433 - в\/ч Ям – Москва (м. Домодедовская)"},{"id":"466","name":"466 - Домодедово (м\/р Дружба) – Москва (м. Домодедовская)"},{"id":"496","name":"496 - ст. Домодедово – Москва (м. Домодедовская)"},{"id":"504","name":"504 - д\/о \"Москвич\" – Москва (м. Домодедовская)"},{"id":"505","name":"505 - в\/ч Ильинское – Москва (м. Домодедовская)"},{"id":"508","name":"508 - о\/к \"Бор\" – Москва (м. Домодедовская)"},{"id":"512","name":"512 - Домодедово м\/р Белые Столбы (Госфильмофонд) – Москва (м. Домодедовская)"}],
		onSelect: displayResultBus
	});
});
</script>